class StopwordsRemover:
    def __init__(self):
        self.stopwords = {
            "في", "من", "على", "إلى", "الى", "عن", "مع", "و", "ف", "ب", "ك", "ل",
            "هو", "هي", "هما", "هم", "هن", "أنا", "انا", "نحن", "أنت", "انت",
            "أنتم", "انتم", "هذا", "هذه", "هؤلاء", "ذلك", "تلك", "الذي", "التي",
            "الذين", "اللذان", "اللتان", "اللاتي", "اللواتي", "أن", "ان", "إن", "ان",
            "هل", "ما", "لا", "ماذا", "لماذا", "متى", "أين", "اين", "كيف", "كم",
            "قد", "لقد", "كان", "كانت", "يكون", "كانوا", "ليس", "ليست", "لكن", "بل"
        }
    def remove(self, words):
        # يقوم بإزالة الكلمات الشائعة من القائمة
        return [w for w in words if w not in self.stopwords]
